app/views/employees/_form.html.erb

SELECT "companies".* FROM "companies"
---
  <div class="field">
    <%= form.select :company_id, options_for_select(Company.all.map {|s| [s.name, s.id]}) %>