app/views/pipelines/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= form.label :categories %>
    <%= form.select :categories, Category.all.map{|c| [c.name,c.id]} %>