app/views/pipelines/show.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."pipeline_id" = $1  [["pipeline_id", 1]]
---
    <div class="field">
      <%=select_tag "category_id", options_for_select(Category.all.map{|s|[s.name, s.id]}) %>

SELECT "companies".* FROM "companies" WHERE "companies"."category_id" = $1  [["category_id", 8]]
---

                  <% category.companies.each do |company| %>