app/views/companies/_company.html.erb

  <h4><%=company.name%></h4>
  <p>Contacts: <%=company.employees.count%><br>
    Job Openings: <%=company.job_openings.count%>
---
SELECT COUNT(*) FROM "employees" WHERE "employees"."company_id" = $1  [["company_id", 3]]
SELECT COUNT(*) FROM "job_openings" WHERE "job_openings"."company_id" = $1  [["company_id", 3]]