app/views/companies/show.html.erb

SELECT  "notes".* FROM "notes" WHERE "notes"."company_id" = $1 ORDER BY "notes"."id" DESC LIMIT $2  [["company_id", 1], ["LIMIT", 1]]
---
<div class="container">
  <div><h2> <%= @company.name %>  <small style="color:indigo"><%=@company.notes.last.description if @company.notes.present?%></small></h2></div>

SELECT "job_openings".* FROM "job_openings" WHERE "job_openings"."company_id" = $1  [["company_id", 1]]
---
  <div class="card-head"><h5>Job Openings</h5></div>
  <div class="card-body"><%@company.job_openings.each do |openings| %>

SELECT "employees".* FROM "employees" WHERE "employees"."company_id" = $1  [["company_id", 1]]
---
  <div class="card">
    <% @company.employees.each do |employee| %>

SELECT "notes".* FROM "notes" WHERE "notes"."company_id" = $1  [["company_id", 1]]
---
  <%end%>
      <% @company.notes.each do |note| %>