app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Initial Prospects"], ["description", "List of prospects"], ["created_at", "2018-04-26 13:43:40.325073"], ["updated_at", "2018-04-26 13:43:40.325073"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def link
    set_category
    @category.companies<<Company.find(params[:company_id])