app/controllers/companies_controller.rb

  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save
---
INSERT INTO "companies" ("name", "phone", "email", "glassdoor", "linkedin", "company_website", "created_at", "updated_at", "category_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @company.update(company_params)
---
UPDATE "companies" SET "name" = $1, "updated_at" = $2 WHERE "companies"."id" = $3  [["name", "Super Gasaaaaadfghgfdswdfghgfdewedfg"], ["updated_at", "2018-07-26 04:46:17.556718"], ["id", 5]]