app/controllers/employees_controller.rb

  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save
---
INSERT INTO "employees" ("name", "position", "phone", "email", "company_id", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"