app/controllers/job_openings_controller.rb

SELECT "job_openings".* FROM "job_openings"
---
  def index
    if params.has_key?(:company_id)
    @company=Company.find(params[:company_id])
    @job_openings= @company.job_openings
    else
    @job_openings = JobOpening.all

SELECT "companies".* FROM "companies"
---
  def new
    @companies=Company.all

INSERT INTO "job_openings" ("title", "category", "description", "company_id", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @job_opening = JobOpening.new(job_opening_params)

    respond_to do |format|
      if @job_opening.save

UPDATE "job_openings" SET "company_id" = $1, "updated_at" = $2 WHERE "job_openings"."id" = $3  [["company_id", 2], ["updated_at", "2018-05-19 13:13:28.298439"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @job_opening.update(job_opening_params)

SELECT  "job_openings".* FROM "job_openings" WHERE "job_openings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_job_opening
      @job_opening = JobOpening.find(params[:id])