app/controllers/notes_controller.rb

  def create
    @note = Note.new(note_params)

    respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("description", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "ngtffhtr"], ["company_id", 2], ["created_at", "2018-05-19 11:57:24.564766"], ["updated_at", "2018-05-19 11:57:24.564766"]]