app/controllers/pipelines_controller.rb

  def index
    @pipelines = Pipeline.all
---
SELECT "pipelines".* FROM "pipelines"

  def create
    @pipeline = Pipeline.new(pipeline_params)

    respond_to do |format|
      if @pipeline.save
---
INSERT INTO "pipelines" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "super Pipeline"], ["description", ""], ["created_at", "2018-07-14 12:00:25.119978"], ["updated_at", "2018-07-14 12:00:25.119978"]]

  def link
    @category = Category.find(params[:category_id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

    def set_pipeline
      @pipeline = Pipeline.find(params[:id])
---
SELECT  "pipelines".* FROM "pipelines" WHERE "pipelines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]