app/views/categories/index.html.erb

                <ul>
                  <% category.companies.each do |company| %>
---
SELECT "companies".* FROM "companies" WHERE "companies"."category_id" = $1  [["category_id", 1]]