app/views/categories/show.html.erb


<%@category.companies.each do |company|%>
---
SELECT "companies"."id" FROM "companies" WHERE "companies"."category_id" = $1  [["category_id", 3]]