app/views/job_openings/_form.html.erb

SELECT "companies".* FROM "companies"
---
  </div>
 <%= form.select :company_id, options_for_select(Company.all.map{|s|[s.name, s.id]}) %>